# Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, 
# что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# Пример:
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

number = int(input("Enter a number -> "))
if number % 3 == 0:
    made_boys = int(number / 3)
    made_boy = int(made_boys / 2)
    made_Katya = int(made_boys * 2)
    print(f'{made_boy} {made_Katya} {made_boy}')
else:
    print('Error')
